#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=d3c9390f84761927de57dad8909a6c059da3a2e2]
local_file.tfkey: Refreshing state... [id=15727e972e8d28d4eec7b0bc9bc5c977eb9bf84a]
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-0c7b2f7a9946eaf48]
data.aws_ami.java-ami: Reading...
aws_vpc.main: Refreshing state... [id=vpc-0ede19981aff42471]
data.aws_ami.java-ami: Read complete after 0s [id=ami-0e5af5a29132d1761]
aws_security_group.elb: Refreshing state... [id=sg-066efdb86e9e5912e]
aws_security_group.allow_http: Refreshing state... [id=sg-0c1bcec292a8df849]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-00dcfc0e7993e28d1]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-023f9ddae3f8e6261]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-00f2615412abdd892]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0dd9752b214f69914]
aws_security_group.allow_ssh: Refreshing state... [id=sg-09399eabdc7136426]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-074ae51d1beab386a]
aws_launch_template.ec2_config: Refreshing state... [id=lt-0833b2bf5074528d6]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0fa66257c37306cee]
aws_instance.bastion-host: Refreshing state... [id=i-0c7ed0bb12f977272]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0150bb0cecb8c8a9f]
aws_route_table.private_route_table: Refreshing state... [id=rtb-096d5952cefade76b]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-0033cae8dd3b978e9]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-0048116cae4ac0b48]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-09f360d241337e31b]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-05ffeb0e292958be5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment will be created
  + resource "aws_autoscaling_attachment" "asg_attachment" {
      + autoscaling_group_name = (known after apply)
      + elb                    = "ELB"
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.auto_scaling_group will be created
  + resource "aws_autoscaling_group" "auto_scaling_group" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "EC2"
      + id                        = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "Auto Scaling Group"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-00dcfc0e7993e28d1",
          + "subnet-074ae51d1beab386a",
        ]
      + wait_for_capacity_timeout = "10m"

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + min_healthy_percentage = 50
              + skip_matching          = false
            }
        }

      + launch_template {
          + id   = (known after apply)
          + name = "terraform-20230130210153046800000001"
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "App Server"
        }
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*